app/controllers/games_controller.rb

  def create
    @human_player = HumanPlayer.create(params[:game])
    @game = Game.create(:human_player => @human_player)
    if @game.human_player.save && @game.save
---
INSERT INTO "games" ("created_at", "updated_at") VALUES('2009-05-04 22:36:20', '2009-05-04 22:36:20')
INSERT INTO "players" ("name", "created_at", "updated_at", "type", "game_id", "strategy", "score") VALUES('John', '2009-05-04 22:36:20', '2009-05-04 22:36:20', 'HumanPlayer', NULL, NULL, 0)
UPDATE "players" SET "updated_at" = '2009-05-04 22:36:20', "game_id" = 1 WHERE "id" = 1

  def choose_players
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def assign_players
    @game = Game.find(params[:id])
    strategy_name = params[:player] || []
    if strategy_name.blank?
      flash[:error] = "Please select at least one computer player"
      redirect_to choose_players_game_path(@game)
    else
      @game.computer_players.clear
      p = ComputerPlayer.new(:strategy => strategy_name)
      @game.computer_players << p
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "players" WHERE ("players".game_id = 1) AND ( ("players"."type" = 'ComputerPlayer' ) )
INSERT INTO "players" ("name", "created_at", "updated_at", "type", "game_id", "strategy", "score") VALUES(NULL, '2009-05-04 22:36:20', '2009-05-04 22:36:20', 'ComputerPlayer', 1, 'Connie', 0)

  def computer_turn
    setup_page_data
    @game.computer_players.each do |cp|
      cp.roller = roller
      turn = cp.take_turn
      cp.score += turn.score
      cp.save
---
SELECT * FROM "players" WHERE ("players".game_id = 1) AND ( ("players"."type" = 'ComputerPlayer' ) )
INSERT INTO "rolls" ("position", "created_at", "action_name", "updated_at", "unused", "accumulated_score", "score", "turn_id") VALUES(1, '2009-05-04 22:36:20', 'hold', '2009-05-04 22:36:20', 2, 0, 0, NULL)
INSERT INTO "turns" ("position", "created_at", "updated_at", "player_id") VALUES(1, '2009-05-04 22:36:20', '2009-05-04 22:36:20', 2)
UPDATE "rolls" SET "updated_at" = '2009-05-04 22:36:20', "accumulated_score" = 200, "score" = 200, "turn_id" = 1 WHERE "id" = 1

  def computer_turn_results
    setup_page_data
    if @game.computer_players.first.score >= 3000
      @winner = @game.computer_players.first.name
      render :action => "game_over"
    else
      @turn_histories = @game.computer_players.map { |p| p.turns.last }
---
SELECT * FROM "players" WHERE ("players".game_id = 1) AND ( ("players"."type" = 'ComputerPlayer' ) ) LIMIT 1
SELECT * FROM "turns" WHERE ("turns".player_id = 2) ORDER BY turns.id DESC LIMIT 1

  def human_start_turn
    setup_page_data
    @game.human_player.roller = roller
    @game.human_player.start_turn
    @game.human_player.roll_dice
    @game.human_player.save!
---
INSERT INTO "rolls" ("position", "created_at", "action_name", "updated_at", "unused", "accumulated_score", "score", "turn_id") VALUES(1, '2009-05-04 22:36:21', NULL, '2009-05-04 22:36:21', 3, 150, 150, 2)
INSERT INTO "turns" ("position", "created_at", "updated_at", "player_id") VALUES(1, '2009-05-04 22:36:21', '2009-05-04 22:36:21', 1)
UPDATE "rolls" SET "updated_at" = '2009-05-04 22:36:21', "action_name" = 'bust' WHERE "id" = 2

  def human_holds
    setup_page_data
    @game.human_player.holds
    @game.human_player.save!
---
UPDATE "players" SET "updated_at" = '2009-05-04 22:36:21', "score" = 150 WHERE "id" = 1

  def human_rolls
    setup_page_data
    @game.human_player.roller = roller
    @game.human_player.rolls_again
    @game.human_player.save!
---
INSERT INTO "rolls" ("position", "created_at", "action_name", "updated_at", "unused", "accumulated_score", "score", "turn_id") VALUES(2, '2009-05-04 22:36:22', NULL, '2009-05-04 22:36:22', 2, 200, 100, 2)
UPDATE "rolls" SET "updated_at" = '2009-05-04 22:36:22', "action_name" = 'roll' WHERE "id" = 2

  def human_turn
    setup_page_data
    @rolls = @game.human_player.turns.last.rolls
---
SELECT * FROM "turns" WHERE ("turns".player_id = 1) ORDER BY turns.id DESC LIMIT 1